---
kind: enumMember
id: F:Autodesk.Revit.DB.ExternalService.DisparityResponse.DoNothing
enum: Autodesk.Revit.DB.ExternalService.DisparityResponse
source: html/29ab805b-5976-912d-3166-ef04d78d612f.htm
---
# Autodesk.Revit.DB.ExternalService.DisparityResponse.DoNothing

Revit is instructed to do nothing. It is assumed that the service
 already handled what needed to be handled (e.g. it set servers
 appropriately to the situation.)